{
	"@metadata": {
		"authors": [
			"Gomoko",
			"Thibaut120094",
			"Verdy p",
			"Wladek92"
		]
	},
	"wsoauth-extensionname": "WSOAuth",
	"wsoauth-desc": "Étend l’extension PluggableAuth pour fournir une authentification utilisant OAuth.",
	"wsoauth-pluggable-auth-class-desc": "Le nom de classe qui étend PluggableAuth ; ce paramètre de configuration est défini par l’extension et ne devrait pas être modifié par l’utilisateur.",
	"wsoauth-uri-desc": "L’URL d’authentification OAuth.",
	"wsoauth-client-id-desc": "La clé de consommateur reçue de l’application OAuth.",
	"wsoauth-client-secret-desc": "Le secret de consommateur reçu de l’application OAuth.",
	"wsoauth-redirect-uri-desc": "L’URL de rappel par défaut vers laquelle reviendra l’application OAuth après une requête d’authentification réussie.",
	"wsoauth-auth-providers-desc": "Un tableau contenant une liste personnalisée de fournisseurs OAuth, conjointement avec leur nom de classe.",
	"wsoauth-auth-provider-desc": "Le fournisseur OAuth que l’extension utilisera.",
	"wsoauth-auto-populate-groups-desc": "Un tableau contenant une liste de noms de groupe MédiaWiki qui doivent être automatiquement affectés à l’utilisateur après s’être authentifié.",
	"wsoauth-pluggable-auth-button-label-message-desc": "Le nom du message qui sera utilisé comme libellé du bouton de connexion sur le formulaire Special:UserLogin.",
	"wsoauth-pluggable-auth-button-label-message": "Connexion avec OAuth",
	"wsoauth-authentication-failure": "Échec d’authentification (êtes-vous autorisé pour ce wiki ?).",
	"wsoauth-invalid-username": "Le nom d’utilisateur donné par le fournisseur OAuth est incorrect.",
	"wsoauth-unknown-auth-provider-class-exception-message": "La classe du fournisseur OAuth n’a pas été chargée ou trouvée",
	"wsoauth-unknown-auth-provider-exception-message": "Fournisseur OAuth inconnu ($1)",
	"wsoauth-invalid-auth-provider-class-exception-message": "La classe du fournisseur OAuth n’implémente pas AuthProvider",
	"wsoauth-initiate-login-failure": "Impossible d’initialiser la communication avec le fournisseur OAuth.",
	"wsoauth-migrate-users-by-username-desc": "S’il faut ou non permettre l’usurpation de comptes existants par nom d’utilisateur.",
	"wsoauth-user-already-exists-message": "Le nom d’utilisateur « $1 » est déjà pris.",
	"wsoauth-not-configured-message": "La connexion à distance n’a pas été configurée pour ce wiki. Veuillez essayer une méthode d’authentification différente.",
	"wsoauth-disallow-remote-only-accounts": "S’il faut ou non autoriser les comptes à ne pas avoir de contrepartie locale.",
	"wsoauth-already-logged-in-through-remote": "Vous êtes déjà connecté via un compte distant ou migré. Vous ne pouvez pas connecter un compte distant pour ce compte. Si vous voulez vous connecter en utilisant un autre compte distant, veuillez vous déconnecter et vous reconnecter en utilisant l’autre compte.",
	"wsoauth-account-already-coupled": "Vous avez déjà connecté ce compte local à un compte distant.",
	"wsoauth-remote-only-accounts-disabled": "La connexion à distance seulement a été désactivée sur ce wiki. Un compte distant doit être connecté à un compte local.",
	"wsoauth-remote-already-used": "Le compte distant « $1 » est déjà connecté à un compte local (différent).",
	"wsoauth-prefs-manage-remote": "Compte distant :",
	"wsoauth-connect-remote": "Connecter un compte distant",
	"wsoauth-remote-connected": "Connecté au compte distant « $1 »",
	"wsoauth-connect-remote-special-page-header": "Activer la connexion à distance",
	"wsoauth-connect-remote-special-page-description": "Vous pouvez activer la connexion à distance en cliquant sur le bouton ci-dessous. Une fois cela fait, vous pourrez utiliser le service à distance pour vous connecter à ce wiki. Vos identifiants locaux demeureront valides.",
	"wsoauth-connect-remote-special-page-wrapper-legend": "Activer la connexion à distance"
}
