{
	"@metadata": {
		"authors": [
			"Eduardo Addad de Oliveira"
		]
	},
	"wsoauth-desc": "Estende a extensão PluggableAuth para fornecer autenticação usando OAuth.",
	"wsoauth-pluggable-auth-class-desc": "O nome da classe que estende PluggableAuth; este parâmetro de configuração é definido pela extensão e não deve ser editado pelo usuário.",
	"wsoauth-uri-desc": "O URL de autenticação OAuth.",
	"wsoauth-client-id-desc": "A chave do consumidor recebida do aplicativo OAuth.",
	"wsoauth-client-secret-desc": "O segredo do consumidor recebido do aplicativo OAuth.",
	"wsoauth-redirect-uri-desc": "O URL de retorno de chamada padrão para o qual o aplicativo OAuth retorna após uma solicitação de autenticação bem-sucedida.",
	"wsoauth-auth-providers-desc": "Uma matriz contendo uma lista de provedores OAuth personalizados junto com seus nomes de classe.",
	"wsoauth-auth-provider-desc": "O provedor OAuth que a extensão usará.",
	"wsoauth-auto-populate-groups-desc": "Um array contendo uma lista de nomes de grupos MediaWiki que devem ser atribuídos automaticamente ao usuário após a autenticação.",
	"wsoauth-pluggable-auth-button-label-message-desc": "O nome da mensagem que será usada para o rótulo do botão de entrar no formulário Special:UserLogin.",
	"wsoauth-pluggable-auth-button-label-message": "Entrar com OAuth",
	"wsoauth-authentication-failure": "A autenticação falhou (você está autorizado para essa wiki?).",
	"wsoauth-invalid-username": "O nome de usuário fornecido pelo provedor OAuth não é válido.",
	"wsoauth-unknown-auth-provider-class-exception-message": "Classe do provedor OAuth não carregada ou não encontrada",
	"wsoauth-unknown-auth-provider-exception-message": "Provedor OAuth desconhecido ($1)",
	"wsoauth-invalid-auth-provider-class-exception-message": "A classe do provedor OAuth não implementa AuthProvider",
	"wsoauth-initiate-login-failure": "Não foi possível iniciar a comunicação com o provedor OAuth.",
	"wsoauth-migrate-users-by-username-desc": "Permitir ou não a usurpação de contas existentes por nome de usuário.",
	"wsoauth-user-already-exists-message": "O nome de usuário \"$1\" já está em uso."
}
