{
	"@metadata": {
		"authors": [
			"Marijn van Wezel <xxmarijnw>",
			"Umherirrender"
		]
	},
	"wsoauth-extensionname": "{{name}}\nThe name of the extension (typically WSOAuth).",
	"wsoauth-desc": "{{desc|name=WSOAuth|url=https://www.mediawiki.org/wiki/Extension:WSOAuth}}",
	"wsoauth-auth-providers-desc": "The description of the configuration parameter that defines the list of custom OAuth providers.",
	"wsoauth-auto-populate-groups-desc": "The description of the configuration parameter that defines the list of MediaWiki groups that get automatically assigned to the user after they are authenticated.",
	"wsoauth-authentication-failure": "Message shown to the user when the authentication failed or when they are not authorised for this wiki.",
	"wsoauth-invalid-username": "Message shown to the user when the OAuth provider returns an invalid username.",
	"wsoauth-unknown-auth-provider-class-exception-message": "Exception message shown when the auth provider class was not loaded or found.",
	"wsoauth-unknown-auth-provider-exception-message": "Exception message shown when the auth provider was not found.",
	"wsoauth-invalid-auth-provider-class-exception-message": "Exception message shown when the auth provider class does not implement AuthProvider.",
	"wsoauth-initiate-login-failure": "Message shown to the user when the communication to the OAuth-provider could not be initialised.",
	"wsoauth-migrate-users-by-username-desc": "The description of the configuration parameter that defines whether ot not to allow account usurpation by username.",
	"wsoauth-not-configured-message": "Message shown to the user if the wiki is not configured for remote login.",
	"wsoauth-disallow-remote-only-accounts-desc": "The description of the configuration parameter that defines whether or not to allow remote accounts without a local counterpart.",
	"wsoauth-already-logged-in-through-remote": "Message shown to the user if they are already logged in through a remote or migrated account.",
	"wsoauth-remote-only-accounts-disabled": "Message shown to the user if remote-only login has been disabled on this wiki.",
	"wsoauth-special-page-content": "The (placeholder) text shown on Special:WSOAuthConnectRemote.",
	"wsoauth-prefs-manage-remote": "Key shown on 'Basic information' section on Special:Preferences.",
	"wsoauth-missing-uri": "Exception message shown when no remote URI is configured.",
	"wsoauth-missing-client-id": "Exception message shown when no client ID is configured.",
	"wsoauth-missing-client-secret": "Exception  message shown when no client secret is configured.",
	"wsoauth-manage-remotes": "Button shown on Special:Preferences to manage your remote accounts.",
	"wsoauth-use-real-name-as-username-desc": "The description of the configuration parameter that defines whether to use the real name as the username.",
	"wsoauth-could-not-create-mapping": "Exception message shown when a mapping could not be created for various reasons.",
	"wsoauth-login-button-label-wikipedia": "Login button text for Wikimedia login (branded as \"Wikipedia\").",
	"wsoauth-login-button-label-wikimedia": "Login button text for Wikimedia login (branded as \"Wikimedia\").",
	"wsoauth-login-button-label-facebook": "Login button text for Facebook login."
}
