{
	"@metadata": {
		"authors": [
			"Eleassar"
		]
	},
	"wsoauth-desc": "Razširi razširitev PluggableAuth za zagotavljanje avtentikacije z OAuth.",
	"wsoauth-auth-providers-desc": "Imenik, ki vsebuje seznam ponudnikov OAuth po meri, vključno z njihovim imenom razreda.",
	"wsoauth-auto-populate-groups-desc": "Polje, ki vsebuje seznam imen skupin MediaWiki, ki morajo biti samodejno dodeljena uporabniku, potem ko se avtenticira.",
	"wsoauth-authentication-failure": "Aventikacija ni uspela (ste pooblaščeni za ta viki?)",
	"wsoauth-invalid-username": "Uporabniško ime, ki ga je posredoval ponudnik OAuth, ni veljavno.",
	"wsoauth-unknown-auth-provider-class-exception-message": "Razred ponudnika OAuth ni naložen ali ni najden",
	"wsoauth-unknown-auth-provider-exception-message": "Neznani ponudnik OAuth ($1)",
	"wsoauth-invalid-auth-provider-class-exception-message": "Razred ponudnika OAuth ne implementira AuthProvider",
	"wsoauth-initiate-login-failure": "Komunikacije s ponudnikom OAuth ni mogoče začeti.",
	"wsoauth-migrate-users-by-username-desc": "Ali naj se dovoli uzurpacija obstoječih računov z uporabniškim imenom (uporablja se le, če <code>migrateUsersByUsername</code> ni nastavljen za določenega ponudnika avtentikacije).",
	"wsoauth-not-configured-message": "Oddaljena prijava ni bila konfigurirana za ta viki. Poskusite z drugo metodo avtentikacije.",
	"wsoauth-disallow-remote-only-accounts-desc": "Ali naj se dovoli, da računi nimajo lokalnega ustreznika (uporablja se le, če <code>disallowRemoteOnlyAccounts</code> ni nastavljen za določenega ponudnika avtentikacije).",
	"wsoauth-already-logged-in-through-remote": "Ste že prijavljeni prek oddaljenega ali preseljenega računa. S tem računom ne morete povezati oddaljenega računa. Če se želite prijaviti z drugim oddaljenim računom, se odjavite in prijavite z drugim računom.",
	"wsoauth-remote-only-accounts-disabled": "Prijava samo na daljavo je bila v tem vikiju onemogočena. Oddaljeni račun mora biti povezan z lokalnim računom.",
	"wsoauth-special-page-content": "Oddaljeni račun lahko povežete s tem računom tako, da se prijavite vanj na [[Special:UserLogin]], medtem ko ste prijavljeni. V prihodnosti bo s te posebne strani mogoče upravljati vaše oddaljene račune.",
	"wsoauth-prefs-manage-remote": "Oddaljeni računi:",
	"wsoauth-missing-uri": "Konfiguriran ni noben oddaljeni URI.",
	"wsoauth-missing-client-id": "Konfiguriran ni noben ID odjemalca.",
	"wsoauth-missing-client-secret": "Konfigurirana ni nobena skrivnost odjemalca.",
	"wsoauth-manage-remotes": "Upravljaj oddaljene račune",
	"wsoauth-use-real-name-as-username-desc": "Ali naj se kot uporabniško ime uporabi pravo ime (uporablja se le, če <code>useRealNameAsUsername</code> ni nastavljeno za določenega ponudnika avtentikacije).",
	"wsoauth-could-not-create-mapping": "Preslikave ni bilo mogoče ustvariti.",
	"wsoauth-login-button-label-wikipedia": "Prijava z Wikipedijo",
	"wsoauth-login-button-label-wikimedia": "Prijava z Wikimedio",
	"wsoauth-login-button-label-facebook": "Prijava s Facebookom"
}
